def getd():
    
    return f"{input('Введите фамилию: ')} {input('Введите имя: ')} {input('Введите класс: ')} {input('Введите букву класса:  ')} {input('Примечание: ')}\n"

def get_number():
    return input('Выберите номер категории\n \
        где: 1-показать все фамилии\n \
             2-показать все имена\n \
             3-показать все № классов\n \
             4-показать учеников выбранного класса\n \
             5-показать всю таблицу\n \
             6-показать информацию по ученику\n \
             7-добавить ученика\n')   